import { useState } from "react";
// import Chat from "../chat/Chat"
import "./activeChat.css"
// import { useNavigate } from "react-router-dom";
// import { v4 as uuidv4 } from 'uuid';

const ActiveChat = () => {
    const [inputText, setInputText] = useState('');
    const [showWarning, setShowWarning] = useState(false);

    // const navigate = useNavigate();

    const handleSubmit = (e) => {
        e.preventDefault();

        if (!inputText.trim()) {
            setShowWarning(true);
            // Hide warning after 3 seconds
            setTimeout(() => setShowWarning(false), 3000);
            return;
        }



    };
    return (

        <div className="active-chat-container">
            <div className="scrollArea">
                <div className="bot">
                    <div className="chat-text" >
                        <p>{`هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى`}</p>
                    </div>
                    <div className="chat-blob" />

                </div>
                <div className="user">
                    <div className="chat-text" >
                        <p>{`هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد  هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من  هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من النص العربى`}</p>
                    </div>
                    <img src="/imgs/logo.svg" alt="" />
                </div>
                <div className="bot">
                    <div className="chat-text" >
                        <p>{`هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى`}</p>
                    </div>
                    <div className="chat-blob" />

                </div>
                <div className="user">
                    <div className="chat-text" >
                        <p>{`هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد  هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من  هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من النص العربى`}</p>
                    </div>
                    <img src="/imgs/logo.svg" alt="" />
                </div>
                <div className="bot">
                    <div className="chat-text" >
                        <p>{`هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى`}</p>
                    </div>
                    <div className="chat-blob" />

                </div>
                <div className="user">
                    <div className="chat-text" >
                        <p>{`هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد  هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من  هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من النص العربى`}</p>
                    </div>
                    <img src="/imgs/logo.svg" alt="" />
                </div>
                <div className="bot">
                    <div className="chat-text" >
                        <p>{`هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى`}</p>
                    </div>
                    <div className="chat-blob" />

                </div>
                <div className="user">
                    <div className="chat-text" >
                        <p>{`هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد  هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من  هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من النص العربى`}</p>
                    </div>
                    <img src="/imgs/logo.svg" alt="" />
                </div>
                <div className="bot">
                    <div className="chat-text" >
                        <p>{`هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى`}</p>
                    </div>
                    <div className="chat-blob" />

                </div>
                <div className="user">
                    <div className="chat-text" >
                        <p>{`هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد  هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من  هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من النص العربى`}</p>
                    </div>
                    <img src="/imgs/logo.svg" alt="" />
                </div>
                <div className="bot">
                    <div className="chat-text" >
                        <p>{`هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى`}</p>
                    </div>
                    <div className="chat-blob" />

                </div>
                <div className="user">
                    <div className="chat-text" >
                        <p>{`هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد  هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من  هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من مولد النص العربى هذا النص هو مثال لنص يمكن أن يستبدل في نفس المساحة، لقد تم توليد هذا النص من النص العربى`}</p>
                    </div>
                    <img src="/imgs/logo.svg" alt="" />
                </div>


            </div>
            <form className="gradient-border-inner" onSubmit={handleSubmit}>
                <div className="chat-input-container">
                    <img className="chat-border" src="/imgs/border.svg" alt="" />
                    <img onClick={handleSubmit} src="/imgs/send.svg" alt="" />
                    <input
                        className="chat-input"
                        type="text"
                        placeholder="قولي بتدور علي اي ؟"
                        value={inputText}
                        onChange={(e) => setInputText(e.target.value)}
                    />
                    <img src="/imgs/Search.svg" alt="" />
                </div>
                {showWarning && (
                    <div className="warning">
                        <p>من فضلك اكتب شي للبحث عنه !</p>
                    </div>
                )}
            </form>
        </div>
    )
}

export default ActiveChat